calaos/calaos_remote_ui/hal/esp32/esp32_hal_network.cpp
#include "esp32_hal_network.h"
#include "esp32_hal_system.h"
#include "logging.h"
#include "esp_netif.h"
#include "esp_wifi_default.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include <cstring>
#include "ethernet_init.h"
#include "esp_eth.h"
#include "esp_hosted.h"
#include "flux.h"
#include "../hal.h"
#include "../calaos_config/device_config.h"

static const char* TAG = "hal.network";

// Static members initialization
QueueHandle_t Esp32HalNetwork::timeoutQueue = nullptr;
TaskHandle_t Esp32HalNetwork::timeoutTaskHandle = nullptr;

// Forward declaration for NTP sync task
static void ntpSyncTask(void* arg);

static void got_ip_event_handler(void *arg, esp_event_base_t event_base,
                                 int32_t event_id, void *event_data)
{
    ip_event_got_ip_t *event = (ip_event_got_ip_t *) event_data;
    const esp_netif_ip_info_t *ip_info = &event->ip_info;

    ESP_LOGI(TAG, "Ethernet Got IP Address");
    ESP_LOGI(TAG, "~~~~~~~~~~~");
    ESP_LOGI(TAG, "IP: " IPSTR, IP2STR(&ip_info->ip));
    ESP_LOGI(TAG, "MASK: " IPSTR, IP2STR(&ip_info->netmask));
    ESP_LOGI(TAG, "GW: " IPSTR, IP2STR(&ip_info->gw));
    ESP_LOGI(TAG, "~~~~~~~~~~~");

    char ipStr[16], gwStr[16], netmaskStr[16];
    snprintf(ipStr, sizeof(ipStr), IPSTR, IP2STR(&ip_info->ip));
    snprintf(gwStr, sizeof(gwStr), IPSTR, IP2STR(&ip_info->gw));
    snprintf(netmaskStr, sizeof(netmaskStr), IPSTR, IP2STR(&ip_info->netmask));

    // Dispatch network connected event
    NetworkStatusChangedData statusData = { true, NetworkConnectionType::Ethernet };
    AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NetworkStatusChanged, statusData));

    // Dispatch IP assigned event
    NetworkIpAssignedData ipData = {
        .ipAddress = std::string(ipStr),
        .gateway = std::string(gwStr),
        .netmask = std::string(netmaskStr),
        .connectionType = NetworkConnectionType::Ethernet,
        .ssid = "",
        .rssi = 0
    };
    AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NetworkIpAssigned, ipData));

    // Stop network timeout - we have a connection
    Esp32HalNetwork* networkHal = static_cast<Esp32HalNetwork*>(arg);
    if (networkHal)
        networkHal->onNetworkConnected();

    // Start NTP sync in a separate task (blocking operation)
    if (!HAL::getInstance().getSystem().isTimeSynced())
        xTaskCreate(ntpSyncTask, "ntp_sync", 4096, nullptr, 5, nullptr);
}

// NTP synchronization task - runs blocking NTP sync after network connection
static void ntpSyncTask(void* arg)
{
    (void)arg;

    ESP_LOGI(TAG, "Starting NTP time synchronization");

    // Dispatch NtpSyncStarted event
    AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NtpSyncStarted));

    // Initialize and wait for NTP sync
    HalSystem& system = HAL::getInstance().getSystem();

    HalResult initResult = system.initNtp();
    if (initResult != HalResult::OK)
    {
        ESP_LOGE(TAG, "Failed to initialize NTP");
        AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NtpSyncFailed));
        system.startNtpRetryTimer();
        vTaskDelete(nullptr);
        return;
    }

    // Wait for sync with 15 second timeout
    HalResult syncResult = system.waitForTimeSync(15000);
    if (syncResult == HalResult::OK)
    {
        ESP_LOGI(TAG, "NTP time synchronization successful");
        // NtpTimeSynced event is dispatched by onNtpSyncComplete() callback
    }
    else
    {
        ESP_LOGW(TAG, "NTP time synchronization failed, starting retry timer");
        AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NtpSyncFailed));
        system.startNtpRetryTimer();
    }

    vTaskDelete(nullptr);
}

HalResult Esp32HalNetwork::init()
{
    esp_err_t ret = esp_netif_init();
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to init netif: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    ret = esp_event_loop_create_default();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE)
    {
        ESP_LOGE(TAG, "Failed to create event loop: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    // Read DeviceConfig to determine which network interface to use
    auto& devCfg = DeviceConfig::getInstance();
    ESP_LOGI(TAG, "DeviceConfig: loaded=%s", devCfg.isLoaded() ? "true" : "false");
    if (devCfg.isLoaded())
    {
        ESP_LOGI(TAG, "DeviceConfig: interface=%s ip_mode=%s",
                 devCfg.getNetworkInterface().c_str(), devCfg.getIpMode().c_str());
        ESP_LOGI(TAG, "DeviceConfig: server_host='%s' port=%u ssl=%s hasServerHost=%s",
                 devCfg.getServerHost().c_str(), devCfg.getServerPort(),
                 devCfg.getServerSsl() ? "true" : "false",
                 devCfg.hasServerHost() ? "true" : "false");
    }

    // Decide which interface to initialize based on DeviceConfig
    bool useWifi = devCfg.isLoaded() && devCfg.isWifi();
    bool useEthernet = !useWifi; // Default: ethernet if no config or config=ethernet

    ESP_LOGI(TAG, "Network mode: %s", useWifi ? "WiFi" : "Ethernet");

    if (useEthernet)
    {
        HalResult ethResult = initEthernet();
        if (ethResult != HalResult::OK)
        {
            ESP_LOGE(TAG, "Failed to initialize ethernet");
            return ethResult;
        }
    }
    else
    {
        HalResult wifiResult = initWifi();
        if (wifiResult != HalResult::OK)
        {
            ESP_LOGE(TAG, "Failed to initialize WiFi");
            return wifiResult;
        }
    }

    // Create timeout queue and task (only once, static)
    if (timeoutQueue == nullptr)
    {
        timeoutQueue = xQueueCreate(5, sizeof(uint32_t));
        xTaskCreate(
            networkTimeoutTask,
            "network_timeout",
            4096,
            nullptr,
            5,
            &timeoutTaskHandle
        );
    }

    // Create and start network timeout timer (30 seconds)
    networkTimeoutTimer = xTimerCreate(
        "network_timeout",
        pdMS_TO_TICKS(30000),
        pdFALSE,
        this,
        networkTimeoutCallback
    );

