calaos/calaos_remote_ui/hal/esp32/esp32_hal_network.cpp
    networkConnected = false;
    startNetworkTimeout();

    return HalResult::OK;
}

HalResult Esp32HalNetwork::initEthernet()
{
    ESP_LOGI(TAG, "Initializing Ethernet");

    uint8_t eth_port_cnt = 0;
    esp_eth_handle_t *eth_handles;
    ESP_ERROR_CHECK(ethernet_init_all(&eth_handles, &eth_port_cnt));

    if (eth_port_cnt == 1)
    {
        esp_netif_config_t cfg = ESP_NETIF_DEFAULT_ETH();
        esp_netif_t *eth_netif = esp_netif_new(&cfg);
        ESP_ERROR_CHECK(esp_netif_attach(eth_netif, esp_eth_new_netif_glue(eth_handles[0])));
        ethHandle = eth_handles[0];
    }
    else if (eth_port_cnt > 1)
    {
        ESP_LOGW(TAG, "Multiple eth ports (%d). Only using first one.", eth_port_cnt);
        esp_netif_config_t cfg = ESP_NETIF_DEFAULT_ETH();
        esp_netif_t *eth_netif = esp_netif_new(&cfg);
        ESP_ERROR_CHECK(esp_netif_attach(eth_netif, esp_eth_new_netif_glue(eth_handles[0])));
        ethHandle = eth_handles[0];
    }
    else
    {
        ESP_LOGE(TAG, "No ethernet ports found");
        return HalResult::ERROR;
    }

    // Register IP event handler for ethernet
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_ETH_GOT_IP, &got_ip_event_handler, this));

    // Register ETH event handler for link-up (used for static IP application)
    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID, &ethEventHandler, this));

    // Start Ethernet driver
    for (int i = 0; i < eth_port_cnt; i++)
        ESP_ERROR_CHECK(esp_eth_start(eth_handles[i]));

    // Print device info
    for (int i = 0; i < eth_port_cnt; i++)
    {
        eth_dev_info_t info = ethernet_init_get_dev_info(&eth_handles[i]);
        if (info.type == ETH_DEV_TYPE_INTERNAL_ETH)
        {
            ESP_LOGI(TAG, "Device Name: %s", info.name);
            ESP_LOGI(TAG, "Device type: ETH_DEV_TYPE_INTERNAL_ETH(%d)", info.type);
            ESP_LOGI(TAG, "Pins: mdc: %d, mdio: %d", info.pin.eth_internal_mdc, info.pin.eth_internal_mdio);
        }
        else if (info.type == ETH_DEV_TYPE_SPI)
        {
            ESP_LOGI(TAG, "Device Name: %s", info.name);
            ESP_LOGI(TAG, "Device type: ETH_DEV_TYPE_SPI(%d)", info.type);
            ESP_LOGI(TAG, "Pins: cs: %d, intr: %d", info.pin.eth_spi_cs, info.pin.eth_spi_int);
        }
    }

    ethInitialized_ = true;
    ESP_LOGI(TAG, "Ethernet initialized successfully");
    return HalResult::OK;
}

HalResult Esp32HalNetwork::initWifi()
{
    ESP_LOGI(TAG, "Initializing WiFi");

    esp_netif_create_default_wifi_sta();

    esp_hosted_coprocessor_fwver_t ver_info = {};
    esp_err_t ret = esp_hosted_get_coprocessor_fwversion(&ver_info);
    if (ret != ESP_OK)
        ESP_LOGW(TAG, "Failed to get coprocessor fw version: %s", esp_err_to_name(ret));
    else
        ESP_LOGI(TAG, "Hosted Coprocessor FW Version: %d.%d.%d", ver_info.major1, ver_info.minor1, ver_info.patch1);

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ret = esp_wifi_init(&cfg);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to init wifi: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    ret = esp_event_handler_instance_register(WIFI_EVENT,
                                             ESP_EVENT_ANY_ID,
                                             &wifiEventHandler,
                                             this,
                                             &wifiHandlerInstance);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to register wifi handler: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    ret = esp_event_handler_instance_register(IP_EVENT,
                                             IP_EVENT_STA_GOT_IP,
                                             &wifiEventHandler,
                                             this,
                                             &ipHandlerInstance);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to register IP handler: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to set wifi mode: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    ret = esp_wifi_start();
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to start wifi: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    // If DeviceConfig has WiFi credentials, set them and connect
    auto& devCfg = DeviceConfig::getInstance();
    if (devCfg.isLoaded() && devCfg.isWifi())
    {
        ESP_LOGI(TAG, "Connecting to WiFi SSID '%s' from DeviceConfig", devCfg.getWifiSsid().c_str());

        wifi_config_t provWifiCfg = {};
        strncpy((char*)provWifiCfg.sta.ssid, devCfg.getWifiSsid().c_str(), sizeof(provWifiCfg.sta.ssid) - 1);
        strncpy((char*)provWifiCfg.sta.password, devCfg.getWifiPassword().c_str(), sizeof(provWifiCfg.sta.password) - 1);
        provWifiCfg.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
        provWifiCfg.sta.pmf_cfg.capable = true;
        provWifiCfg.sta.pmf_cfg.required = false;

        ret = esp_wifi_set_config(WIFI_IF_STA, &provWifiCfg);
        if (ret != ESP_OK)
            ESP_LOGW(TAG, "Failed to set wifi config from DeviceConfig: %s", esp_err_to_name(ret));
        else
        {
            ret = esp_wifi_connect();
            if (ret != ESP_OK)
                ESP_LOGW(TAG, "Failed to connect wifi: %s", esp_err_to_name(ret));
            else
                ESP_LOGI(TAG, "WiFi connect initiated from DeviceConfig");
        }
    }

    wifiInitialized_ = true;
    ESP_LOGI(TAG, "WiFi initialized successfully");
    return HalResult::OK;
}

HalResult Esp32HalNetwork::deinit()
{
    // Stop and delete timeout timer
    if (networkTimeoutTimer)
    {
        xTimerStop(networkTimeoutTimer, 0);
        xTimerDelete(networkTimeoutTimer, 0);
        networkTimeoutTimer = nullptr;
    }

    if (wifiInitialized_)
    {
        esp_wifi_stop();
        esp_wifi_deinit();
        wifiInitialized_ = false;
        ESP_LOGI(TAG, "WiFi deinitialized");
    }

    if (ethInitialized_)
    {
        if (ethHandle)
        {
            esp_eth_stop(ethHandle);
            ethHandle = nullptr;
        }
        ethInitialized_ = false;
        ESP_LOGI(TAG, "Ethernet deinitialized");
    }

    return HalResult::OK;
}

HalResult Esp32HalNetwork::scanWifi(std::vector<WifiConfig>& networks)
{
    networks.clear();

    wifi_scan_config_t scanConfig = {};
    scanConfig.ssid = nullptr;
    scanConfig.bssid = nullptr;
    scanConfig.channel = 0;
    scanConfig.show_hidden = false;
    scanConfig.scan_type = WIFI_SCAN_TYPE_ACTIVE;
    scanConfig.scan_time.active.min = 100;
    scanConfig.scan_time.active.max = 300;

    esp_err_t ret = esp_wifi_scan_start(&scanConfig, true);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to start scan: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    uint16_t apCount = 0;
    ret = esp_wifi_scan_get_ap_num(&apCount);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to get AP count: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    if (apCount > 0)
    {
        wifi_ap_record_t* apRecords = new wifi_ap_record_t[apCount];
        ret = esp_wifi_scan_get_ap_records(&apCount, apRecords);
        if (ret == ESP_OK)
        {
            for (int i = 0; i < apCount; i++)
            {
                WifiConfig config;
                config.ssid = std::string((char*)apRecords[i].ssid);
                config.rssi = apRecords[i].rssi;
                memcpy(config.bssid, apRecords[i].bssid, 6);
                networks.push_back(config);
            }
        }
        delete[] apRecords;
    }

    return HalResult::OK;
}

HalResult Esp32HalNetwork::connectWifi(const WifiConfig& config)
{
    wifi_config_t wifiConfig = {};
    strncpy((char*)wifiConfig.sta.ssid, config.ssid.c_str(), sizeof(wifiConfig.sta.ssid) - 1);
    strncpy((char*)wifiConfig.sta.password, config.password.c_str(), sizeof(wifiConfig.sta.password) - 1);
    wifiConfig.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    wifiConfig.sta.pmf_cfg.capable = true;
    wifiConfig.sta.pmf_cfg.required = false;

    esp_err_t ret = esp_wifi_set_config(WIFI_IF_STA, &wifiConfig);
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to set wifi config: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    ret = esp_wifi_connect();
    if (ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to connect wifi: %s", esp_err_to_name(ret));
        return HalResult::ERROR;
    }

    wifiStatus = WifiStatus::CONNECTING;
    return HalResult::OK;
}

HalResult Esp32HalNetwork::disconnectWifi()
{
    esp_err_t ret = esp_wifi_disconnect();
    wifiStatus = WifiStatus::DISCONNECTED;
    return (ret == ESP_OK) ? HalResult::OK : HalResult::ERROR;
}

