calaos/calaos_remote_ui/hal/esp32/esp32_hal_network.cpp
WifiStatus Esp32HalNetwork::getWifiStatus() const
{
    return wifiStatus;
}

HalResult Esp32HalNetwork::registerWifiCallback(WifiEventCallback callback)
{
    wifiCallback = callback;
    return HalResult::OK;
}

std::string Esp32HalNetwork::getLocalIp() const
{
    // Check the interface that was actually initialized
    const char* ifkey = ethInitialized_ ? "ETH_DEF" : "WIFI_STA_DEF";
    esp_netif_t* netif = esp_netif_get_handle_from_ifkey(ifkey);
    if (!netif)
        return "";

    esp_netif_ip_info_t ipInfo;
    esp_err_t ret = esp_netif_get_ip_info(netif, &ipInfo);
    if (ret != ESP_OK)
        return "";

    char ipStr[16];
    snprintf(ipStr, sizeof(ipStr), IPSTR, IP2STR(&ipInfo.ip));
    return std::string(ipStr);
}

std::string Esp32HalNetwork::getMacAddress() const
{
    uint8_t mac[6];

    // Try Ethernet first if connected
    if (ethernetConnected && ethHandle)
    {
        esp_err_t ret = esp_eth_ioctl(ethHandle, ETH_CMD_G_MAC_ADDR, mac);
        if (ret == ESP_OK)
        {
            auto macStr = std::make_unique<char[]>(18);
            snprintf(macStr.get(), 18, "%02X:%02X:%02X:%02X:%02X:%02X",
                     mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
            return std::string(macStr.get());
        }
    }

    // Fallback to WiFi if connected
    if (wifiConnected)
    {
        esp_err_t ret = esp_wifi_get_mac(WIFI_IF_STA, mac);
        if (ret == ESP_OK)
        {
            auto macStr = std::make_unique<char[]>(18);
            snprintf(macStr.get(), 18, "%02X:%02X:%02X:%02X:%02X:%02X",
                     mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
            return std::string(macStr.get());
        }
    }

    return "";
}

void Esp32HalNetwork::applyStaticIpConfig(esp_netif_t *netif, const char *ifkey)
{
    auto& devCfg = DeviceConfig::getInstance();
    if (!devCfg.isLoaded() || !devCfg.isStaticIp())
        return;

    ESP_LOGI(TAG, "Applying static IP on %s: ip=%s mask=%s gw=%s dns=%s",
             ifkey,
             devCfg.getStaticIp().c_str(),
             devCfg.getStaticMask().c_str(),
             devCfg.getStaticGateway().c_str(),
             devCfg.getStaticDns().c_str());

    // Stop DHCP client first
    esp_err_t ret = esp_netif_dhcpc_stop(netif);
    ESP_LOGI(TAG, "  DHCP client stop: %s", esp_err_to_name(ret));

    esp_netif_ip_info_t ipInfo = {};
    esp_netif_str_to_ip4(devCfg.getStaticIp().c_str(), &ipInfo.ip);
    esp_netif_str_to_ip4(devCfg.getStaticMask().c_str(), &ipInfo.netmask);
    esp_netif_str_to_ip4(devCfg.getStaticGateway().c_str(), &ipInfo.gw);

    ret = esp_netif_set_ip_info(netif, &ipInfo);
    if (ret != ESP_OK)
        ESP_LOGW(TAG, "  Failed to set static IP: %s", esp_err_to_name(ret));
    else
        ESP_LOGI(TAG, "  Static IP set successfully (will trigger IP event)");

    // Set DNS if provided
    if (!devCfg.getStaticDns().empty())
    {
        esp_netif_dns_info_t dnsInfo = {};
        esp_netif_str_to_ip4(devCfg.getStaticDns().c_str(), &dnsInfo.ip.u_addr.ip4);
        dnsInfo.ip.type = ESP_IPADDR_TYPE_V4;
        ret = esp_netif_set_dns_info(netif, ESP_NETIF_DNS_MAIN, &dnsInfo);
        ESP_LOGI(TAG, "  DNS set: %s (result: %s)",
                 devCfg.getStaticDns().c_str(), esp_err_to_name(ret));
    }
}

void Esp32HalNetwork::ethEventHandler(void* arg, esp_event_base_t eventBase,
                                      int32_t eventId, void* eventData)
{
    Esp32HalNetwork* self = static_cast<Esp32HalNetwork*>(arg);

    if (eventId == ETHERNET_EVENT_CONNECTED)
    {
        ESP_LOGI(TAG, "Ethernet link up");
        self->ethernetConnected = true;

        // Apply static IP right after link-up (before DHCP kicks in)
        auto& devCfg = DeviceConfig::getInstance();
        if (devCfg.isLoaded() && devCfg.isStaticIp())
        {
            esp_netif_t* ethNetif = esp_netif_get_handle_from_ifkey("ETH_DEF");
            if (ethNetif)
                applyStaticIpConfig(ethNetif, "ETH_DEF");
            else
                ESP_LOGW(TAG, "ETH_DEF netif not found for static IP");
        }
    }
    else if (eventId == ETHERNET_EVENT_DISCONNECTED)
    {
        ESP_LOGI(TAG, "Ethernet link down");
        self->ethernetConnected = false;

        NetworkStatusChangedData statusData = { false, NetworkConnectionType::Ethernet };
        AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NetworkStatusChanged, statusData));
    }
    else if (eventId == ETHERNET_EVENT_START)
    {
        ESP_LOGI(TAG, "Ethernet started");
    }
    else if (eventId == ETHERNET_EVENT_STOP)
    {
        ESP_LOGI(TAG, "Ethernet stopped");
    }
}

void Esp32HalNetwork::wifiEventHandler(void* arg, esp_event_base_t eventBase,
                                       int32_t eventId, void* eventData)
{
    Esp32HalNetwork* self = static_cast<Esp32HalNetwork*>(arg);

    if (eventBase == WIFI_EVENT && eventId == WIFI_EVENT_STA_START)
    {
        ESP_LOGI(TAG, "WiFi started");
    }
    else if (eventBase == WIFI_EVENT && eventId == WIFI_EVENT_STA_CONNECTED)
    {
        ESP_LOGI(TAG, "WiFi connected to AP");

        // Apply static IP right after association (before DHCP starts)
        auto& devCfg = DeviceConfig::getInstance();
        if (devCfg.isLoaded() && devCfg.isStaticIp())
        {
            esp_netif_t* staNetif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
            if (staNetif)
                applyStaticIpConfig(staNetif, "WIFI_STA_DEF");
            else
                ESP_LOGW(TAG, "WIFI_STA_DEF netif not found for static IP");
        }
    }
    else if (eventBase == WIFI_EVENT && eventId == WIFI_EVENT_STA_DISCONNECTED)
    {
        ESP_LOGI(TAG, "WiFi disconnected");
        self->wifiStatus = WifiStatus::DISCONNECTED;
        self->wifiConnected = false;
        if (self->wifiCallback)
            self->wifiCallback(self->wifiStatus);
    }
    else if (eventBase == IP_EVENT && eventId == IP_EVENT_STA_GOT_IP)
    {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*)eventData;
        ESP_LOGI(TAG, "Got IP: " IPSTR, IP2STR(&event->ip_info.ip));
        self->wifiStatus = WifiStatus::CONNECTED;
        self->wifiConnected = true;

        // Get WiFi info (SSID, RSSI)
        wifi_ap_record_t apInfo;
        std::string ssid = "";
        int rssi = 0;
        if (esp_wifi_sta_get_ap_info(&apInfo) == ESP_OK)
        {
            ssid = std::string((char*)apInfo.ssid);
            rssi = apInfo.rssi;
        }

        // Convert IP info to strings
        char ipStr[16], gwStr[16], netmaskStr[16];
        snprintf(ipStr, sizeof(ipStr), IPSTR, IP2STR(&event->ip_info.ip));
        snprintf(gwStr, sizeof(gwStr), IPSTR, IP2STR(&event->ip_info.gw));
        snprintf(netmaskStr, sizeof(netmaskStr), IPSTR, IP2STR(&event->ip_info.netmask));

