calaos/calaos_remote_ui/hal/esp32/esp32_hal_network.cpp
        // Dispatch network connected event
        NetworkStatusChangedData statusData = { true, NetworkConnectionType::WiFi };
        AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NetworkStatusChanged, statusData));

        // Dispatch IP assigned event with WiFi details
        NetworkIpAssignedData ipData = {
            .ipAddress = std::string(ipStr),
            .gateway = std::string(gwStr),
            .netmask = std::string(netmaskStr),
            .connectionType = NetworkConnectionType::WiFi,
            .ssid = ssid,
            .rssi = rssi
        };
        AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NetworkIpAssigned, ipData));

        // Stop network timeout - WiFi connected
        self->networkConnected = true;
        self->stopNetworkTimeout();

        if (self->wifiCallback)
            self->wifiCallback(self->wifiStatus);

        // Start NTP sync in a separate task (blocking operation)
        // Only if not already synced (ethernet might have already synced)
        if (!HAL::getInstance().getSystem().isTimeSynced())
        {
            xTaskCreate(ntpSyncTask, "ntp_sync", 4096, nullptr, 5, nullptr);
        }
    }
}

void Esp32HalNetwork::onNetworkConnected()
{
    networkConnected = true;
    ethernetConnected = true;
    stopNetworkTimeout();
}

void Esp32HalNetwork::startNetworkTimeout()
{
    if (networkTimeoutTimer)
        xTimerStart(networkTimeoutTimer, 0);
}

void Esp32HalNetwork::stopNetworkTimeout()
{
    if (networkTimeoutTimer)
        xTimerStop(networkTimeoutTimer, 0);
}

void Esp32HalNetwork::networkTimeoutCallback(TimerHandle_t timer)
{
    Esp32HalNetwork* networkHal = static_cast<Esp32HalNetwork*>(pvTimerGetTimerID(timer));
    if (networkHal && !networkHal->networkConnected)
    {
        ESP_LOGW(TAG, "Network connection timeout - no connection after 30 seconds");

        // Send timeout signal to the task via queue (safe from timer context)
        uint32_t timeoutSignal = 1;
        if (timeoutQueue)
        {
            xQueueSend(timeoutQueue, &timeoutSignal, 0); // Don't block in timer
        }
    }
}

void Esp32HalNetwork::networkTimeoutTask(void* parameter)
{
    uint32_t signal;

    while (true)
    {
        // Wait for timeout signals from timer callback
        if (xQueueReceive(timeoutQueue, &signal, portMAX_DELAY) == pdTRUE)
        {
            ESP_LOGW(TAG, "Processing network timeout in task context");
            // Now we can safely dispatch the event from task context
            AppDispatcher::getInstance().dispatch(AppEvent(AppEventType::NetworkTimeout));
        }
    }
}